// 1 Отфильтруйте отрицательные элементы в массиве, оставив только положительные
let array_1 = [1, -2, 3, -4, 5, -6, 7, -8, 9, -10]
let array_1_1 = array_1.filter((item) => item < 0)

// 2 Найдите сумму элементов массива которые меньше 100 по значению

let arr = [3, 2, 5, 6]

function arraySum(array) {
  let sum = 0
  for (let i = 0; i < array.length; i++) {
    if (array[i] < 100) {
      sum += array[i]
    }
  }
  return sum
}

// 3 Уменьшите каждый элемент массива на 3%

processArray(arr);

      function processArray(){
      
        for (let i = 0; i < arr.length; i++) {
          arr[i] = arr[i] * 0.03;
        }
        console.log(arr);        
        
      }

// 4 Если все элементы массива меньше 100 увеличьте их на 5%
// 5 Проверьте является ли слово палиндромом (например слово abcddcba подходит т.к. оно "зеркальное")

function palindrome(str) {
  return str.split('').reverse().join('') == str;
}
// 6 Соедините две строки в одну и переверните наоборот
// 7* Напишите функцию, которая преобразует первую букву каждого слова строки в верхний регистр.
// 8* Вывести индексы минимальных элементов массива
